In [14]:
import pandas as pd
import sqlite3 as SQL

In [8]:
#!pip install ipython-sql

In [15]:
df = pd.DataFrame({'name':['Juan', 'Victoria', 'Mary'],
                  'age': [ 22, 34, 45],
                  'city':['Miami', 'Buenos Aires', 'Santiago']})
df

       name  age          city
0      Juan   22         Miami
1  Victoria   34  Buenos Aires
2      Mary   45      Santiago

In [16]:
cnn = SQL.connect('jupyter_sql_tutorial.db')

In [18]:
df.to_sql('people', cnn) # table name 'people'

In [19]:
%load_ext sql # jupyter line magic

In [20]:
%sql sqlite:///jupyter_sql_tutorial.db

In [23]:
%%sql # shell magic

SELECT * FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 22, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aires'),
 (2, 'Mary', 45, 'Santiago')]

In [24]:
%%sql

SELECT count(*) FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(3,)]

In [25]:
%%sql

SELECT sum(age) as age_sum FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(101,)]

In [27]:
import pandas as pd

In [28]:
df = pd.DataFrame(
    {
        "Name" : ["Broad",
                 "Alen",
                 "Bonnel",],
        "Age":[32,34,43],
        "Sex":["Male", "male", "female"],
    }
)

In [29]:
df

     Name  Age     Sex
0   Broad   32    Male
1    Alen   34    male
2  Bonnel   43  female

In [32]:
df['Name']#'Name'

0     Broad
1      Alen
2    Bonnel
Name: Name, dtype: object

In [33]:
df.Name

0     Broad
1      Alen
2    Bonnel
Name: Name, dtype: object

In [34]:
ages = pd.Series([22,35,58], name="Age")

In [35]:
ages

0    22
1    35
2    58
Name: Age, dtype: int64